In [2]:
import pandas as pd

In [3]:
local_source = '../../datasets/titanic.csv'
df = pd.read_csv(local_source)

In [ ]:
df

# 4.1 Listing All Columns

In [ ]:
df.columns

In [ ]:
df.columns[10]

In [ ]:
type(df.columns)

### Getting columns by data types

In [ ]:
df.dtypes

In [ ]:
df.select_dtypes(include=['float64'])

In [ ]:
df.select_dtypes(include=['bool'])

In [ ]:
df.select_dtypes(include=['int'])

In [ ]:
df.select_dtypes(include=['object'])

## Listing all string columns

In [ ]:
list(df.select_dtypes(['object']).columns)

## Listing all integer value columns

In [ ]:
list(df.select_dtypes(['int']).columns)

# 4.2 Changing Column Name

In [ ]:
df

In [ ]:
df.rename(columns = {'Survived':'SurvivedTrip'}, inplace = True)

In [ ]:
df

# 4.3 Getting a single column specific values

In [ ]:
df['Name']

In [ ]:
type(df['Name'])

In [ ]:
type(df.Name)

In [ ]:
df.Name

In [ ]:
df.Name.value_counts()

In [ ]:
df.Age

In [ ]:
df.Age.value_counts()

In [ ]:
len(df.Age.value_counts())

In [ ]:
type(df.Age)

In [ ]:
df.Age.unique()

In [ ]:
type(df.Age.unique())

# 4.4 Data from multiple selected columns

In [ ]:
df[['Age','Name', 'Sex' ]]

# 4.5 Filter data based on values

In [ ]:
df['Age'] > 30

In [ ]:
df[df['Age'] > 30].shape

In [ ]:
df[df['Age'] > 30]

In [ ]:
df['Sex'] == 'male'

In [ ]:
df[df['Sex'] == 'male']

In [ ]:
df[df['Name'] == 'Markun, Mr. Johann']

In [ ]:
df[df['Name'] == '*Mr*']

# 4.6 Filter values based on multiple values in a single column dependency

In [ ]:
df[df["Pclass"].isin([2])]

In [ ]:
df[df["Pclass"].isin([2,3])]

In [ ]:
df[(df["Pclass"] == 2) | (df["Pclass"] == 3)]

# 4.7 Filtering all the correct non empty rows based on specific column

In [ ]:
df[df["Age"].notna()]

# 4.8 Filtering rows based on single column data and showing selected column only

In [ ]:
df.loc[df["Age"] > 50, "Name"]

In [ ]:
df_filtered_name = df.loc[df["Age"] > 50, "Name"]

In [ ]:
df_filtered_name

In [ ]:
# Added intentionally to show the limitation
df.loc[df["Age"] > 50, "Name", 'Sex']
df.loc[df["Age"] > 50,  df["Sex"] > 'male', "Name"]

# 4.9 Updating Data into new Column based on Column Specific Value

In [ ]:
def ageAbove50(row):
    if row['Age'] >= 50:
        return True
    else:
        return False;

In [ ]:
df['AgeAbove50'] = df.apply(lambda row: ageAbove50(row), axis=1)

In [ ]:
df[['AgeAbove50', 'Age']].sample(100)

In [ ]:
def ageAbove50AndMale(row):
    if row['Age'] >= 50 and row['Sex'] == 'male':
        return True
    else:
        return False;

In [ ]:
df['AgeAbove50AndMale'] = df.apply(lambda row: ageAbove50AndMale(row), axis=1)

In [ ]:
df[df['AgeAbove50AndMale'] == True].shape

In [ ]:
df[df['AgeAbove50AndMale'] == True]

# 4.10 Unique values in column

In [ ]:
df['Name']

In [ ]:
df['Sex'].unique()

In [ ]:
df['Age'].unique()

In [ ]:
len(df['Age'])

In [ ]:
len(df['Age'].unique())

In [ ]:
df_age = df['Age'].unique()

In [ ]:
df.Age.value_counts()

In [ ]:
df_age

In [ ]:
len(df_age)

# 4.11 Changing Values in the existing column

In [ ]:
df['Age'].isnull().values.sum()

In [ ]:
df['Age'].isnull()

In [ ]:
df['Age'] = df['Age'].fillna(0)

In [ ]:
df['Age'].isnull().values.sum()

In [ ]:
# The below function require NumPy package to be present
df['Age'] = df['Age'].replace(np.nan, 0)

In [ ]:
# Instead of using a new column name you can use the existing column for Inplace update
df['Age_times_3'] = df['Age']*3

In [ ]:
df.sample()

# 4.12 Changing string column values to upper case or lower case

In [ ]:
df['Name'].str.upper()

In [ ]:
df['Name'] = df['Name'].str.upper()

In [ ]:
df.head(5)

In [ ]:
df['Name'] = df['Name'].str.lower()

In [ ]:
df.head(5)

# 4.13 Removing one or more columns from the DataFrame

In [ ]:
df

## Deleting Columns by name

In [ ]:
df.drop(["AgeAbove50", "AgeAbove50AndMale"], axis = 1, inplace = True)

In [ ]:
df

# 4.14 Deleting rows by Index

In [73]:
df_with_index = pd.read_csv(local_source, index_col='Name')

In [ ]:
df_with_index

In [ ]:
df_with_index.drop(["Heikkinen, Miss. Laina"], inplace = True)

In [ ]:
df_with_index

In [ ]:
df_with_index.drop(["Behr, Mr. Karl Howell","Montvila, Rev. Juozas" ], inplace = True)

In [ ]:
df_with_index

# 4.15 Updating the cell value directly in the dataframe (Inplace)

In [5]:
df.iloc[100]

PassengerId                        101
Survived                             0
Pclass                               3
Name           Petranec, Miss. Matilda
Sex                             female
Age                                 28
SibSp                                0
Parch                                0
Ticket                          349245
Fare                            7.8958
Cabin                              NaN
Embarked                             S
Name: 100, dtype: object

In [4]:
df.iloc[[100]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
100,101,0,3,"Petranec, Miss. Matilda",female,28.0,0,0,349245,7.8958,NaN,S

In [6]:
df.iloc[[100]]['Survived']

100    0
Name: Survived, dtype: int64

In [15]:
df.iloc[[100]]['Survived'] = 1

/Users/avkash/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [16]:
df.iloc[[100]]['Survived']

100    0
Name: Survived, dtype: int64

In [38]:
df_with_index

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
"Montvila, Rev. Juozas",887,0,2,male,27.0,0,0,211536,13.0000,NaN,S
"Graham, Miss. Margaret Edith",888,1,1,female,19.0,0,0,112053,30.0000,B42,S
"Johnston, Miss. Catherine Helen ""Carrie""",889,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
"Behr, Mr. Karl Howell",890,1,1,male,26.0,0,0,111369,30.0000,C148,C
"Dooley, Mr. Patrick",891,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

In [39]:
df_with_index[0:10]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
"Moran, Mr. James",6,0,3,male,NaN,0,0,330877,8.4583,NaN,Q
"McCarthy, Mr. Timothy J",7,0,1,male,54.0,0,0,17463,51.8625,E46,S
"Palsson, Master. Gosta Leonard",8,0,3,male,2.0,3,1,349909,21.0750,NaN,S
"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",9,1,3,female,27.0,0,2,347742,11.1333,NaN,S
"Nasser, Mrs. Nicholas (Adele Achem)",10,1,2,female,14.0,1,0,237736,30.0708,NaN,C

In [40]:
df_with_index[0:1]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.25,NaN,S

In [74]:
df_with_index[0:1]['Survived']

Name
Braund, Mr. Owen Harris    0
Name: Survived, dtype: int64

In [75]:
df_with_index[0:1].iloc[0,1] = 1

/Users/avkash/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:965: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

In [76]:
df_with_index[0:1]['Survived']

Name
Braund, Mr. Owen Harris    1
Name: Survived, dtype: int64

In [77]:
df_with_index.loc[df_with_index['Ticket'] == 'STON/O2. 3101282']['Survived']

Name
Heikkinen, Miss. Laina    1
Name: Survived, dtype: int64

In [78]:
df_with_index.loc[df_with_index['Ticket'] == 'STON/O2. 3101282', 'Survived'] = 10

In [79]:
df_with_index.loc[df_with_index['Ticket'] == 'STON/O2. 3101282']

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Heikkinen, Miss. Laina",3,10,3,female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S